---
kind: property
id: P:Autodesk.Revit.DB.AssemblyMemberDifferentType.TypeId2
source: html/35312379-1947-3beb-f427-bd6ea921db4d.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifferentType.TypeId2 Property

Type id of the second assembly member

## Syntax (C#)
```csharp
public ElementId TypeId2 { get; }
```